turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3sd8/atdf/ATSAM3SD8C.atdf
        <register caption="Interrupt Mask Register" name="ACC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Status Register" name="ACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
          <bitfield caption="Synchronized Comparator Output" mask="0x00000002" name="SCO"/>
          <bitfield caption="" mask="0x80000000" name="MASK"/>
        </register>
        <register caption="Analog Control Register" name="ACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Current SELection" mask="0x00000001" name="ISEL" values="ACC_ACR__ISEL"/>
          <bitfield caption="HYSTeresis selection" mask="0x00000006" name="HYST"/>
        </register>
        <register caption="Write Protect Mode Register" name="ACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="ACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write PROTection ERRor" mask="0x00000001" name="WPROTERR"/>
        </register>
      </register-group>
      <value-group caption="" name="ACC_MR__SELMINUS">
        <value caption="SelectTS" name="TS" value="0x0"/>
        <value caption="Select ADVREF" name="ADVREF" value="0x1"/>
        <value caption="Select DAC0" name="DAC0" value="0x2"/>
        <value caption="Select DAC1" name="DAC1" value="0x3"/>
        <value caption="Select AD0" name="AD0" value="0x4"/>
        <value caption="Select AD1" name="AD1" value="0x5"/>
        <value caption="Select AD2" name="AD2" value="0x6"/>
        <value caption="Select AD3" name="AD3" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELPLUS">
        <value caption="Select AD0" name="AD0" value="0x0"/>
        <value caption="Select AD1" name="AD1" value="0x1"/>
        <value caption="Select AD2" name="AD2" value="0x2"/>
        <value caption="Select AD3" name="AD3" value="0x3"/>
        <value caption="Select AD4" name="AD4" value="0x4"/>
        <value caption="Select AD5" name="AD5" value="0x5"/>
        <value caption="Select AD6" name="AD6" value="0x6"/>
        <value caption="Select AD7" name="AD7" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__ACEN">
        <value caption="Analog Comparator Disabled." name="DIS" value="0"/>
        <value caption="Analog Comparator Enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__EDGETYP">
        <value caption="only rising edge of comparator output" name="RISING" value="0x0"/>
        <value caption="falling edge of comparator output" name="FALLING" value="0x1"/>
        <value caption="any edge of comparator output" name="ANY" value="0x2"/>
      </value-group>
      <value-group caption="" name="ACC_MR__INV">
        <value caption="Analog Comparator output is directly processed." name="DIS" value="0"/>
        <value caption="Analog Comparator output is inverted prior to being processed." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELFS">
        <value caption="the CF flag is used to drive the FAULT output." name="CF" value="0"/>
        <value caption="the output of the Analog Comparator flag is used to drive the FAULT output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__FE">
        <value caption="the FAULT output is tied to 0." name="DIS" value="0"/>
        <value caption="the FAULT output is driven by the signal defined by SELFS." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_ACR__ISEL">
        <value caption="low power option." name="LOPW" value="0"/>
        <value caption="high speed option." name="HISP" value="1"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC" version="6489I">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Automatic Calibration of ADC" mask="0x00000008" name="AUTOCAL"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Settling Time" mask="0x00300000" name="SETTLING" values="ADC_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
        <register caption="Channel Sequence Register 1" name="ADC_SEQR1" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Sequence Number 1" mask="0x00000007" name="USCH1"/>
          <bitfield caption="User Sequence Number 2" mask="0x00000070" name="USCH2"/>
          <bitfield caption="User Sequence Number 3" mask="0x00000700" name="USCH3"/>
          <bitfield caption="User Sequence Number 4" mask="0x00007000" name="USCH4"/>
          <bitfield caption="User Sequence Number 5" mask="0x00070000" name="USCH5"/>
          <bitfield caption="User Sequence Number 6" mask="0x00700000" name="USCH6"/>
          <bitfield caption="User Sequence Number 7" mask="0x07000000" name="USCH7"/>
          <bitfield caption="User Sequence Number 8" mask="0x70000000" name="USCH8"/>
        </register>
        <register caption="Channel Sequence Register 2" name="ADC_SEQR2" offset="0x0C" rw="RW" size="4">
          <bitfield caption="User Sequence Number 9" mask="0x00000007" name="USCH9"/>
          <bitfield caption="User Sequence Number 10" mask="0x00000070" name="USCH10"/>
          <bitfield caption="User Sequence Number 11" mask="0x00000700" name="USCH11"/>
          <bitfield caption="User Sequence Number 12" mask="0x00007000" name="USCH12"/>
          <bitfield caption="User Sequence Number 13" mask="0x00070000" name="USCH13"/>
          <bitfield caption="User Sequence Number 14" mask="0x00700000" name="USCH14"/>
          <bitfield caption="User Sequence Number 15" mask="0x07000000" name="USCH15"/>
          <bitfield caption="User Sequence Number 16" mask="0x70000000" name="USCH16"/>
        </register>
